## Plan Result (543: test_appgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw"
        name                              = "aks-fe-00-test-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/vh-admin-web" -> null
          - ip_addresses = [
              - "10.141.15.250",
              - "10.141.31.250",
            ] -> null
          - name         = "vh-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/vh-test-web" -> null
          - ip_addresses = [
              - "10.141.15.250",
              - "10.141.31.250",
            ] -> null
          - name         = "vh-test-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/vh-video-web" -> null
          - ip_addresses = [
              - "10.141.15.250",
              - "10.141.31.250",
            ] -> null
          - name         = "vh-video-web" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/darts-portal" -> null
          - name                                = "darts-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/darts-portal" -> null
          - probe_name                          = "darts-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/juror-bureau" -> null
          - name                                = "juror-bureau" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/juror-bureau" -> null
          - probe_name                          = "juror-bureau" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/juror-public" -> null
          - name                                = "juror-public" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/juror-public" -> null
          - probe_name                          = "juror-public" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend" -> null
          - name                                = "pip-frontend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/pip-frontend" -> null
          - probe_name                          = "pip-frontend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in" -> null
          - name                                = "pip-frontend-b2c-sign-in" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/pip-frontend-b2c-sign-in" -> null
          - probe_name                          = "pip-frontend-b2c-sign-in" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend-b2c-staff" -> null
          - name                                = "pip-frontend-b2c-staff" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/pip-frontend-b2c-staff" -> null
          - probe_name                          = "pip-frontend-b2c-staff" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pre-portal" -> null
          - name                                = "pre-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/pre-portal" -> null
          - probe_name                          = "pre-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - name                                = "sds-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/sds-api-mgmt" -> null
          - probe_name                          = "sds-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/toffee" -> null
          - name                                = "toffee" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/toffee" -> null
          - probe_name                          = "toffee" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/vh-admin-web" -> null
          - name                                = "vh-admin-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/vh-admin-web" -> null
          - probe_name                          = "vh-admin-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/vh-test-web" -> null
          - name                                = "vh-test-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/vh-test-web" -> null
          - probe_name                          = "vh-test-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/vh-video-web" -> null
          - name                                = "vh-video-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/vh-video-web" -> null
          - probe_name                          = "vh-video-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/darts-portal"
          + name                                = "darts-portal"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/darts-portal"
          + probe_name                          = "darts-portal"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/juror-bureau"
          + name                                = "juror-bureau"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/juror-bureau"
          + probe_name                          = "juror-bureau"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/juror-public"
          + name                                = "juror-public"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/juror-public"
          + probe_name                          = "juror-public"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend"
          + name                                = "pip-frontend"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/probes/pip-frontend"
          + probe_name                          = "pip-frontend"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in"
          + name                                = "pip-frontend-b2c-sign-in"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscrip

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - backend_http_settings_name  = "sds-api-mgmt" -> null
          - http_listener_id            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/sds-api-mgmt" -> null
          - http_listener_name          = "sds-api-mgmt" -> null
          - id                          = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/sds-api-mgmt" -> null
          - name                        = "sds-api-mgmt" -> null
          - priority                    = 90 -> null
          - rewrite_rule_set_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/toffee" -> null
          - backend_address_pool_name   = "toffee" -> null
          - backend_http_settings_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/toffee" -> null
          - backend_http_settings_name  = "toffee" -> null
          - http_listener_id            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/toffee" -> null
          - http_listener_name          = "toffee" -> null
          - id                          = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/toffee" -> null
          - name                        = "toffee" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/vh-admin-web" -> null
          - backend_address_pool_name   = "vh-admin-web" -> null
          - backend_http_settings_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/vh-admin-web" -> null
          - backend_http_settings_name  = "vh-admin-web" -> null
          - http_listener_id            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/vh-admin-web" -> null
          - http_listener_name          = "vh-admin-web" -> null
          - id                          = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/vh-admin-web" -> null
          - name                        = "vh-admin-web" -> null
          - priority                    = 80 -> null
          - rewrite_rule_set_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/vh-test-web" -> null
          - backend_address_pool_name   = "vh-test-web" -> null
          - backend_http_settings_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/vh-test-web" -> null
          - backend_http_settings_name  = "vh-test-web" -> null
          - http_listener_id            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/vh-test-web" -> null
          - http_listener_name          = "vh-test-web" -> null
          - id                          = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/vh-test-web" -> null
          - name                        = "vh-test-web" -> null
          - priority                    = 60 -> null
          - rewrite_rule_set_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/vh-video-web" -> null
          - backend_address_pool_name   = "vh-video-web" -> null
          - backend_http_settings_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/vh-video-web" -> null
          - backend_http_settings_name  = "vh-video-web" -> null
          - http_listener_id            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/vh-video-web" -> null
          - http_listener_name          = "vh-video-web" -> null
          - id                          = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/vh-video-web" -> null
          - name                        = "vh-video-web" -> null
          - priority                    = 70 -> null
          - rewrite_rule_set_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/darts-portal"
          + backend_address_pool_name  = "darts-portal"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/darts-portal"
          + backend_http_settings_name = "darts-portal"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/darts-portal"
          + http_listener_name         = "darts-portal"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/darts-portal"
          + name                       = "darts-portal"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/pip-frontend"
          + backend_address_pool_name  = "pip-frontend"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend"
          + backend_http_settings_name = "pip-frontend"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/pip-frontend"
          + http_listener_name         = "pip-frontend"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/pip-frontend"
          + name                       = "pip-frontend"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/pip-frontend-b2c-sign-in"
          + backend_address_pool_name  = "pip-frontend-b2c-sign-in"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in"
          + backend_http_settings_name = "pip-frontend-b2c-sign-in"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/pip-frontend-b2c-sign-in"
          + http_listener_name         = "pip-frontend-b2c-sign-in"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/pip-frontend-b2c-sign-in"
          + name                       = "pip-frontend-b2c-sign-in"
          + priority                   = 40
          + rewrite_rule_set_id        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/pip-frontend-b2c-staff"
          + backend_address_pool_name  = "pip-frontend-b2c-staff"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/pip-frontend-b2c-staff"
          + backend_http_settings_name = "pip-frontend-b2c-staff"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/pip-frontend-b2c-staff"
          + http_listener_name         = "pip-frontend-b2c-staff"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/pip-frontend-b2c-staff"
          + name                       = "pip-frontend-b2c-staff"
          + priority                   = 50
          + rewrite_rule_set_id        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendAddressPools/toffee"
          + backend_address_pool_name  = "toffee"
          + backend_http_settings_id   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/backendHttpSettingsCollection/toffee"
          + backend_http_settings_name = "toffee"
          + http_listener_id           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/httpListeners/toffee"
          + http_listener_name         = "toffee"
          + id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/requestRoutingRules/toffee"
          + name                       = "toffee"
          + priority                   = 10
          + rewrite_rule_set_id        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-bureau"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-bureau"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-bureau"
          + id                          = (known after apply)
          + name                        = "juror-bureau"
          + priority                    = 90
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-public"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-public"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-public"
          + id                          = (known after apply)
          + name                        = "juror-public"
          + priority                    = 80
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-portal"
          + id                          = (known after apply)
          + name                        = "pre-portal"
          + priority                    = 70
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sds-api-mgmt"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sds-api-mgmt"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sds-api-mgmt"
          + id                          = (known after apply)
          + name                        = "sds-api-mgmt"
          + priority                    = 60
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (17 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 543: test_appgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/947/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":947,"Program":"tfcmt","SHA1":"","Target":"543: test_appgateway - TerraformPlanApply","Vars":{}} -->